fn main() {
    println!("{}", "-".repeat(40));
    /*
     * Statically Typed และการอนุมาณชนิดข้อมูล
     */
    // เราสามารถประกาศชนิดข้อมูลอย่างชัดเจนได้
    // 'i32' คือ signed 32-bit integer
    let a: i32 = 100;
    // a = 100.5; // จะเกิดข้อผิดพลาด เพราะ 'a' ถูกประกาศเป็น 'i32'

    // หรืออจะปล่อยให้คอมไพเลอร์อนุณยชนิดข้อมูลให้ก็ได้
    let b = -200;
    // b = 200.5; // จะเกิดข้อผิดพลาด เพราะ 'b' ถูกอนุมานป็น 'i32'

    println!("interger with explicit type: {}", a);
    println!("interger with inferred type: {}", b);

    /*
     * Scalar Types: Floating-Points
     */
    println!("{}", "-".repeat(40));
    let temp: f64 = 3.12345678901234567890123456789;
    let pressure: f32 = 10.1234567890123456789;
    println!("floating-point with explicit type: {}", temp);
    println!("floating-point with inferred type: {}", pressure);

    /*
     * Signed and Unsigned Integer
     */
    println!("{}", "-".repeat(40));
    let balance: i32 = -500;
    let age: u32 = 32;
    println!("balance: {}", balance);
    println!("age: {}", age);

    /*
     * ชนิดข้อมูลและขนาดในหน่วยความจำ (Bits)
     */
    println!("{}", "-".repeat(40));
    // i8 ใช้ 8 bits (1 byte) สามารถเก็บค่าได้ตั้งแต่ -128 ถึง 127
    // u8 ใช้ 8 bits (1 byte) สามารถเก็บค่าได้ตั้งแต่ 0 ถึง 255
    let small_signed_number: i8 = -128; // -128 ถึง 127
    println!("small signed number: {}", small_signed_number);
    let small_unsigned_number: u8 = 255; // 0 ถึง 255
    println!("small unsigned number: {}", small_unsigned_number);
    // i16 ใช้ 16 bits (2 bytes) สามารถเก็บค่าได้ตั้งแต่ -32768 ถึง 32767
    // u16 ใช้ 16 bits (2 bytes) สามารถเก็บค่าได้ตั้งแต่ 0 ถึง 65535
    let medium_unsigned_number: u16 = 65535;
    println!("medium unsigned number: {}", medium_unsigned_number);
    let medium_signed_number: i16 = -32768;
    println!("medium signed number: {}", medium_signed_number);

    // i32 ใช้ 32 bits (4 bytes) สามารถเก็บค่าได้ตั้งแต่ -2147483648 ถึง 2147483647
    // u32 ใช้ 32 bits (4 bytes) สามารถเก็บค่าได้ตั้งแต่ 0 ถึง 4294967295
    // i64 ใช้ 64 bits (8 bytes) สามารถเก็บค่าได้ตั้งแต่ -9223372036854775808 ถึง 9223372036854775807
    // u64 ใช้ 64 bits (8 bytes) สามารถเก็บค่าได้ตั้งแต่ 0 ถึง 18446744073709551615
    // i128 ใช้ 128 bits (16 bytes) สามารถเก็บค่าได้ตั้งแต่ -170141183460469231731687303715884105728 ถึง 170141183460469231731687303715884105727
    // u128 ใช้ 128 bits (16 bytes) สามารถเก็บค่าได้ตั้งแต่ 0 ถึง 340282366920938463463374607431768211455

    /*
     * Boolean Type
     */
    // Booleen type มีแค่สองค่าคือ true หรือ false
    println!("{}", "-".repeat(40));
    let is_active: bool = true;
    println!("is_active: {}", is_active);
    let is_logged_in: bool = false;
    println!("is_logged_in: {}", is_logged_in);

    /*
     * Character Type
     */
    // Character type ใช้เก็บตัวอักษร Unicode มีขนาด 4 bytes
    // สามารถเก็บตัวอักษร ตัวเลข หรือสัญลักษณ์ได้
    println!("{}", "-".repeat(40));
    let letter: char = 'R';
    let emoji: char = '😊';
    println!("letter: {}", letter);
    println!("emoji: {}", emoji);

    /*
     * Character Type String
     */
    // String type ใช้เก็บข้อความหรือชุดอักขระ Unicode มีขนาดไม่จำกัด
    println!("{}", "-".repeat(40));
    let greeting: String = "Hello, Rust!".to_string();
    println!("greeting: {}", greeting);

    /*
     * ตัวแปร (Variable)
     */
    println!("{}", "-".repeat(40));
    // ประกาศตัวแปรชื่อ 'x' และกำหนดค่าเป็น 5
    let x: i32 = 5;
    println!("x: {}", x);

    /*
     * Interpolation (การแทรกค่าในสตริง)
     * */
    // แทรกค่าของตัวแปร 'name' และ 'age' ในสตริง
    let name: String = "Pongsak".to_string();
    let age: i32 = 32;
    println!("My name is {} and I am {} years old.", name, age);

    //  {0} คือตำแหน่งของตัวแปรแรก
    //  {1} คือตำแหน่งของตัวแปรที่สอง
    println!(
        "{0} is a friend of {1}. And {1} is also a friend of {0}",
        "Alice", "Bob"
    );

    /*
    Mutability and Immutable (การเปลี่ยนค่าได้และไม่ได้)
    */
    println!("{}", "-".repeat(40));
    // โดยพื้นฐานแล้ว ตัวแปรใน Rust เป็น Immutable (ไม่สามารถเปลี่ยนแปลงค่าได้) เว้นแต่จะระบุ mut
    //  'immutable_variable' คือไม่สามารถเปลี่ยนแปลงค่าได้
    //  'mutable_variable' คือสามารถเปลี่ยนแปลงค่าได้
    let immutable_variable: i32 = 10;
    // immutable_variable = 20; // จะเกิดข้อผิดพลาด เพราะ 'immutable_variable' เป็น Immutable
    println!("immutable_variable: {}", immutable_variable);

    // 'mutable_variable' คือสามารถเปลี่ยนแปลงค่าได้ ต้องระบุ mut
    let mut mutable_variable: i32 = 10;
    println!("mutable_variable: {}", mutable_variable);
    mutable_variable = 20; // สามารถเปลี่ยนแปลงค่าได้ เพราะก่อนหน้านี้ระชุ mut mutable_variable ไว้
    println!("mutable_variable: {}", mutable_variable);
    mutable_variable += 5; // เพิ่มค่าอีก 5
    println!("mutable_variable: {}", mutable_variable);
    mutable_variable *= 2; // คูณค่าด้วย 2
    println!("mutable_variable: {}", mutable_variable);

    /*
    Constant (ค่าคงที่)
    */
    // ประกาศค่าคงที่ ต้องระบุชนิดข้อมูล (type annotation)
    println!("{}", "-".repeat(40));
    // Constant เป็นค่าคงที่ ไม่สามารถเปลี่ยนแปลงค่าได้
    const MAX_POINTS: u32 = 100_000;
    const MIN_POINTS: u32 = 0;

    // ค่าคงที่ไม่สามารถเปลี่ยนแปลงค่าได้
    // MAX_POINTS = 200_000; // จะเกิดข้อผิดพลาด เพราะ 'MAX_POINTS' เป็น Constant จะ Error ตอน compile
    println!("MAX_POINTS: {}", MAX_POINTS);
    println!("MIN_POINTS: {}", MIN_POINTS);

    /*
     *Variable Shadowing (การบดบังตัวแปร)
     */
    println!("{}", "-".repeat(40));
    let x: i32 = 5;
    println!("x: {}", x);
    let x: i32 = 6;
    println!("x: {}", x);
    let x: String = "Hello".to_string();
    println!("x: {}", x);

    /*
     * Scope and Blocks (ขอบเขตและส่วนโค้ด)
     */
    println!("{}", "-".repeat(40));
    let outer_var = "I'm outside";
    println!("outer_var: {}", outer_var);
    {
        let inner_var = "I'm inside";
        println!("[ inner_var: {}", inner_var);
        println!("outer_var: {} ]", outer_var);
    }
    println!("outer_var: {}", outer_var);

    println!("{}", "-".repeat(40));
    // unused_function();

    /* Type Aliases (การตั้งชื่อแฝงให้ชนิดข้อมูล) */
    println!("{}", "-".repeat(40));
    let distance: Kilometers = 42; // ชื่อแฝง 'Kilometers' ที่เราสร้างขึ้น
    println!("Distance in kilometers: {}", distance);
    let another_distance: i32 = 42;
    println!("Distance in kilometers: {}", another_distance);

    /*
     * Rust Error Codes (การจัดการกับข้อผิดพลาด)
     */
    println!("{}", "-".repeat(40));
    let result = divide(10.0, 2.0);
    match result {
        Ok(value) => println!("Result: {}", value),
        Err(e) => println!("Error: {}", e),
    }
    let result = divide(10.0, 0.0);
    match result {
        Ok(value) => println!("Result: {}", value),
        Err(e) => println!("Error: {}", e),
    }
}

/*
 * Rust Error Codes (การจัดการกับข้อผิดพลาด)
 */
// Rust เน้นการจัดการข้อผิดพลาดด้วย 'Result<T, E>' และ Option<T> enum แทนการใช้ error code แบบบดั้งเดิม
// 'T' คือประเภทข้อมูลที่ส่งกลับเมื่อไม่เกิดข้อผิดพลาด
// 'E' คือประเภทข้อมูลที่ส่งกลับเมื่อเกิดข้อผิดพลาด
fn divide(numerator: f64, demoninator: f64) -> Result<f64, &'static str> {
    if demoninator == 0.0 {
        Err("Division by zero is not allowed")
    } else {
        Ok(numerator / demoninator)
    }
}

/*
 * Type Aliases (การตั้งชื่อแฝงให้ชนิดข้อมูล)
 */
// สร้างชื่อแฝง 'Kilometers' ให้กับชนิดข้อมูล 'i32'
type Kilometers = i32;

/*
 * Compiler Directives like allow (แอตทริบิวต์ของคอมไพเลอร์)
 */
// #[allowed(dead_code]) จะบอกคอมไพเลอร์ว่าไม่ต้องแจ้ง error ถ้ามีตัวแปรที่ไม่ถูกใช้
// #[allowed(unused_variables)] จะบอกคอมไพเลอร์ว่าไม่ต้องแจ้ง error ถ้ามีตัวแปรที่ไม่ถูกใช้
#[allow(dead_code)]
#[allow(unused_variables)]
fn unused_function() {
    let unused_var = 5; // ตัวแปรที่ไม่ได้ถูกใช้งาน
    println!("This function is unused");
}
